<a href="https://colab.research.google.com/github/JLeninMChura/BigDataClase0001/blob/main/Clase_001.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Ejercicio 1 - Carga de un archivo CSV desde Drive

In [45]:
import pandas as pd

In [46]:
datos = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vRAw21hrrSAlaHSVZ5gH8N8GjfYrgJM5HMPxpjhl63P-dDQa7o4I1NpV_vKGxjNrHizQ4YN1mE-Pj7W/pub?gid=1804714029&single=true&output=csv")

print(datos)

       nombre  edad    ciudad  ingresos
0        Juan    30      Lima      2500
1       María    28  Arequipa      3800
2        Luis    35     Cusco      4800
3         Ana    22  Trujillo      2000
4       Pedro    28  Arequipa      3200
5      Leonel    64   Juliaca      4980
6       Laura    31      Lima      4200
7      Carlos    25     Cusco      1800
8       Sofía    29  Trujillo      2900
9      Andrés    27      Lima      2600
10   Gabriela    33  Arequipa      4000
11    Micaela    21   Juliaca      5000
12      Diego    24     Cusco      3200
13  Valentina    26  Trujillo      3500
14     Lorena    30      Lima      3800
15     Javier    32  Arequipa      5000
16    Daniela    29      Lima      2700
17     Manuel    31  Trujillo      2700
18   Fernanda    28     Cusco      2100
19    Ricardo    35      Lima      4400
20      Lucía    23  Trujillo      1500
21       José    34  Arequipa      4200
22      Willy    55      Puno      1300

In [26]:
#Obtenemos la suma total de la comuna ingresos
suma_ingresos = datos['ingresos'].sum()
print("La suma de la columna ingresos es ",suma_ingresos)

La suma de la columna ingresos es  76180

In [27]:
#obtenemos le promedio de edad de lso trabajaddores
promedio_edad=datos['edad'].mean()
print("El promedio de edad de los trabajadores es",int(promedio_edad))

El promedio de edad de los trabajadores es 31

In [31]:
#obtemos las personas que trabaja nen arequipa
personas_arequipa = datos.loc[datos["ciudad"] == "Arequipa"]
print(personas_arequipa)

      nombre  edad    ciudad  ingresos
1      María    28  Arequipa      3800
4      Pedro    28  Arequipa      3200
10  Gabriela    33  Arequipa      4000
15    Javier    32  Arequipa      5000
21      José    34  Arequipa      4200

In [35]:
#promedio de ingresos por ciudad
ciudades_ingresos = datos.groupby("ciudad")
promedio_ingresos_ciudad = ciudades_ingresos["ingresos"].mean()
print(promedio_ingresos_ciudad)

ciudad
Arequipa    4040.000000
Cusco       2975.000000
Juliaca     4990.000000
Lima        3366.666667
Puno        1300.000000
Trujillo    2520.000000
Name: ingresos, dtype: float64

In [37]:
datos_ordenados = datos.sort_values("edad")
persona_mas_joven = datos_ordenados.iloc[0]
persona_mas_mayor = datos_ordenados.iloc[-1]
print("Persona más joven:")
print(persona_mas_joven)

print("Persona más mayor:")
print(persona_mas_mayor)

Persona más joven:
nombre      Micaela
edad             21
ciudad      Juliaca
ingresos       5000
Name: 11, dtype: object
Persona más mayor:
nombre       Leonel
edad             64
ciudad      Juliaca
ingresos       4980
Name: 5, dtype: object

In [42]:
joven=datos.loc[datos['edad']==datos['edad'].max()].values[0]
print(joven);

['Leonel' 64 'Juliaca' 4980]

In [48]:
#numero de personas que trabajan por ciudades
personas_ciudades=datos.groupby("ciudad")["nombre"].count()
print(personas_ciudades)

ciudad
Arequipa    5
Cusco       4
Juliaca     2
Lima        6
Puno        1
Trujillo    5
Name: nombre, dtype: int64

In [55]:
#listado de personas de mayor a menor
personas_ciudad_ordenadas = personas_ciudad.sort_values("edad")

print(datos_ordenados)

       nombre  edad    ciudad  ingresos
11    Micaela    21   Juliaca      5000
3         Ana    22  Trujillo      2000
20      Lucía    23  Trujillo      1500
12      Diego    24     Cusco      3200
7      Carlos    25     Cusco      1800
13  Valentina    26  Trujillo      3500
9      Andrés    27      Lima      2600
1       María    28  Arequipa      3800
4       Pedro    28  Arequipa      3200
18   Fernanda    28     Cusco      2100
16    Daniela    29      Lima      2700
8       Sofía    29  Trujillo      2900
14     Lorena    30      Lima      3800
0        Juan    30      Lima      2500
6       Laura    31      Lima      4200
17     Manuel    31  Trujillo      2700
15     Javier    32  Arequipa      5000
10   Gabriela    33  Arequipa      4000
21       José    34  Arequipa      4200
19    Ricardo    35      Lima      4400
2        Luis    35     Cusco      4800
22      Willy    55      Puno      1300
5      Leonel    64   Juliaca      4980

#Ejercicio 2 - Carga de archivo CSV Desde drive